Repository: soloveyko19/spyfall-game-bot
Catalog: src/bot/locales/*/LC_MESSAGES/messages.po
Languages: uk

source: *Вы успешно сделали [{name}](tg://user?id={tg_id}) администратором\!*
uk: *Ви успішно зробили [{name}](tg://user?id={tg_id}) адміністратором\!*

source: *[{name}](tg://user?id={tg_id}) назначил Вас моим администратором\!*
uk: *[{name}](tg://user?id={tg_id}) назначив Вас моїм адміністратором\!*

source: *Введите номер фидбэка на который желаете ответить 👇*
uk: *Введіть номер фідбеку на який маєте намір відповісти 👇*

source: *Ответ от разработчика на ваш фидбэк №{feedback_id}:* {feedback_message}
uk: *Відповідь від розробника на ваш фідбек №{feedback_id}:* {feedback_message}

source: Отправлено\!
uk: Відправлено\!

source: *Привет\!* 👋 Добавь меня в группу где будем играть\!
uk: *Привіт\!* 👋 Додай мене до групи де будемо грати\!

source: *Язык группы изменен на: {language}*
uk: *Мова групи змінена на: {language}*

source: *Все доступные локации:*
uk: *Усі доступні локації:*

source: *Выберите опцию:*
uk: *Виберіть опцію:*

source: *Давайте добавим локацию\!* _Отправьте название локации в формате перечисления через комму\._
uk: *Давайте додамо локацію\!* _Відправте назву локації у форматі перерахування через кому\._

source: У вас нет доступа к этой функции
uk: У вас немає доступу до цієї функції

source: *Напишите какой текст будет на кнопке*
uk: *Напишіть текст який буде на кнопці*

source: *Какой язык рассылки\?*
uk: *Яка мова розсилки\?*

source: *Подтвердите что хотите разослать это сообщение\.* Язык рассылки: {language}
uk: *Підтвердьте, що хочете розіслати це повідомлення\.* Мова розсилки: {language}

source: *Сейчас ваш язык: {language} Выберите язык *
uk: *Зараз ваша мова: {language} Виберіть мову *

source: Этот проект полностью лежит на плечах одного разработчика\, который оплачивает хостинг для этого бота и уделяет большое кол\-во времени на его поддержку\. Так что при желании у вас есть возможность поблагодарить его угостив чашечкой кофе по ссылке ниже либо отсканировав QR\-код :\)
uk: Цей проєкт лежить на плечах одного розробника\, котрий оплачує хостинг для цього бота та виділяє велику кількість часу на його підтримку\. Так що при бажанні у вас є можливість подякувати йому\, пригостивши чашкою кави по посиланню нижче або відсканувавши QR\-код :\)

source: *Чтобы обратиться к разработчику напишите свой комментарий ниже\. 👇* _Напоминаем что это не коммерческий продукт и каждый ваш отзыв помогает улучшить его\._
uk: *Щоб звернутися до розробника напишіть своє повідомлення у чат\. 👇* _Нагадуємо що цей бот не є комерційним та кожне ваше повідомлення допомагає стати йому кращим\._

source: Для этой функции необходимы права администратора!
uk: Для цієї функції необхідні права адміністратора!

source: *Меню для админов\! 💅*
uk: *Меню для адмінів\! 💅*

source: *Вы собираетесь добавить администратора для этого бота\! 👨‍💻* _Пожалуйста\, поделитесь контактом пользователя которого вы хотите назначить администратором 👇_
uk: *Ви збираєтесь додати адміністратора до цього бота\! 👨‍💻* _Будь ласка\, поділіться контактом користувача якого ви бажаєте зробити адміном _

source: *Вы собираетесь сделать рассылку\!* Отправьте сообщение которое вы хотите разослать\.
uk: *Ви збираєтесь зробити розсилку\!* Відправте повідомлення яке маєте намір розслати\.

source: *Вы отдали свой голос за [{name}](tg://user?id={tg_id})\!*
uk: *Ви віддали свій голос за [{name}](tg://user?id={tg_id})\!*

source: *[{name}](tg://user?id={tg_id}) проголосовал\(\-а\)\!*
uk: *[{name}](tg://user?id={tg_id}) проголосував\(\-ла\)\!*

source: *Ошибка значения\, лимит должен быть указан в числовом значении\!*
uk: *Помилка значення\, Ліміт має бути вказаним в числовому форматі\!*

source: *Для начала игры предоставьте мне необходимые права администратора\!*
uk: *Для початку гри надайте мені необхідні права адміністратора\!*

source: *Игра уже запущена\!* ⛔️
uk: *Гра вже почата\!* ⛔️

source: *\+{extend_time}с к регистрации\!* _Оставшееся время \- {sec}с\._
uk: *\+{extend_time}с до реєстрації\!* _Залишилось часу \- {sec}с\._

source: *Игра не запущена\! ❌* _Нужно как минимум 4 участника для игры\._
uk: *Гру не почато\! ❌* _Потрібно як мінімум 4 учасника для гри\._

source: *Игра не запущена\! ❌* _Максимум 10 игроков в игре\._
uk: *Гру не почато\! ❌* _Максимум 10 учасників у грі\._

source: *Вы Шпион\! 🦸* _Не дайте остальным участникам вычислить вашу роль\!_
uk: *Ви Шпигун\! 🦸* _Не дайте іншим гравцям дізнатися вашу роль\!_

source: *Вы НЕ Шпион\! 👨* Локация: *{location}* _Вычислите шпиона\!_
uk: *Ви НЕ Шпигун\! 👨* Локація: *{location}* _Дізнайтеся хто шпигун\!_

source: *Осталась 1 минута до голосования\! ⏳*
uk: *Залишилась 1 хвилина до голосування\! ⏳*

source: *Время на обсуждение вышло\! ⌛️* Давайте проголосуем за шпиона\!
uk: *Час на обговорення вийшов\! ⌛️* Давайте проголосуємо за шпигуна\!

source: *Кто шпион? 🦸*
uk: *Хто шпигун? 🦸*

source: *Мнения разошлись\, а значит победа Шпиона\! 💁‍♂️* Шпионом был\(\-a\) [{name}](tg://user?id={tg_id})
uk: *Думки розійшлись\, а це означає перемога Шпигуна\! 💁‍♂️* Шпигуном був\(\-лa\) [{name}](tg://user?id={tg_id})

source: *Большинство проголосовало за [{name}](tg://user?id={tg_id})*
uk: *Більшість проголосувало за [{name}](tg://user?id={tg_id})*

source: *Победа мирных игроков\!* _Личность шпиона раскрыта\!_
uk: *Перемога мирних гравців\!* _Особа шпигуна розкрита\!_

source: *Победа Шпиона\!* _Его личность не раскрыта\!_ Шпионом был\(\-a\) [{name}](tg://user?id={tg_id})
uk: *Перемога Шпигуна\!* _Його особа не розкрита\!_ Шпигуном був\(\-лa\) [{name}](tg://user?id={tg_id})

source: *Игра была отменена\. ❌*
uk: *Гра була зупинена\. ❌*

source: Нельзя увеличить время более чем на 300с за раз\.
uk: Не можна збільшити час більш ніж на 300с за раз\.

source: Нельзя увеличить время менее чем на 10с\.
uk: Не можна збільшити час менш ніж на 10с\.

source: *Сейчас язык группы: {language} Выберите язык*
uk: *Зараз мова групи: {language} Виберіть мову*

source: *Чтобы поменять язык в группе, вам сначала нужно инициализировать беседу с ботом\!*
uk: *Щоб змінити мову в групі, спочатку вам треба ініціалізувати бесіду з ботом\!*

source: *Ошибка ❗️* _Такой игры не существует либо она уже была окончена\._
uk: *Помилка ❗️* _Такої гри не існує, або вона вже була завершена\._

source: *Ошибка ❗️* Набор в игру уже окончен\!
uk: *Помилка ❗️* Набір до гри вже завершено\!

source: *Вы уже в игре\!* ⛔️
uk: *Ви вже у грі\!* ⛔️

source: *Вы присоединились к игре в Шпиона\! ✅*
uk: *Ви приєдналися до гри в Шпигуна\! ✅*

source: *Отмена\! ❌* Все состояния сняты\!
uk: *Відміна\! ❌* Усі стани зброшені\!

source: *Привет\! 👋* *Чтобы начать игру предоставьте мне следующие права администратора:* \- Удалять сообщения \- Блокировать пользователей \- Закреплять сообщения
uk: *Привіт\! 👋* *Щоб почати гру, спочатку надайте мені наступні права адміністратора:* \- Видаляти повідомлення \- Блокувати користувачів \- Закріплювати повідомлення

source: *Вы ограничили права бота\!* _Для начала игры предоставьте мне необходимые права администратора_
uk: *Ви обмежили права бота\!* _Для початку гри надайте мені необхідні права адміністратора_

source: *Отлично\! ✅ Все права предоставлены\!* 😎 Можем начнать игру /game
uk: *Добре\! ✅ Усі права надані\!* 😎 Можемо починати гру /game

source: *Предоставлены не все необходимые права администратора\:* {rule_1} \- Удалять сообщения {rule_2} \- Блокировать пользователей {rule_3} \- Закреплять сообщения
uk: *Надані не всі необхідні права адміністратора\:* {rule_1} \- Видаляти повідомлення {rule_2} \- Блокувати користувачів {rule_3} \- Закріплювати повідомлення

source: Отменить! ❌
uk: Відмінити! ❌

source: Отменено\!
uk: Відмінено\!

source: *Такого пользователя нет в моей системе\!* _Сперва ему нужно ввести команду /start\._
uk: *Такого користувача немає в моїй системі\!* _Спочатку йому потрібно ввести команду /start\._

source: *[{full_name}](tg://user?id={tg_id}) уже является администратором\!*
uk: *[{full_name}](tg://user?id={tg_id}) вже є адміністратором\!*

source: *Вы уверенны что хотите сделать [{full_name}](tg://user?id={tg_id}) администратором?*
uk: *Ви впевнені що бажаєте зробити [{name}](tg://user?id={tg_id}) адміністратором?*

source: *Подтвердите, пожалуйста 👇*
uk: *Підтвердіть, будь ласка 👇*

source: *Некоректный ввод\(*_Пожалуйста, поделитесь пользователем через клавиатуру 👇_
uk: *Некоректне введення\(*_Будь ласка, Поділіться користувачем через клавіатуру 👇_

source: *Спасибо за фидбэк\! ❤️* Номер вашего запроса: {feedback_id} _Ваше сообщение отправлено и будет принято во внимание разработчиками\!_
uk: *Дякуємо за фідбек\! ❤️* Номер вашого запиту: {feedback_id} _Ваше повідомлення надіслано та буде прийнято до уваги розробниками\!_

source: *Пожалуста\, введите номер фидбэка на который желаете ответить*
uk: *Будь ласка\, введіть номер фідбека на який бажаєте відповісти*

source: *Фидбэка с таким номером нет\! Проверьте номер\, и попробуйте еще раз\.*
uk: *Фідбека з таким номером немає\! Перевірте номер\, і спробуйте ще раз\.*

source: *Вы хотите ответить на фидбэк:* [{user_full_name}](tg://user?id={user_tg_id}): {message} Отправьте ваш ответ на фидбэк 👇
uk: *Ви хочете відповісти на фідбек:* [{user_full_name}](tg://user?id={user_tg_id}): {message} Надішліть вашу відповідь на фідбек 👇

source: Подтвердите отправку ответа на фидбэк
uk: Підтвердіть надсилання відповіді на фідбек

source: *Локации добавлены:*
uk: *Локації додані:*

source: *Добавим еще\?*
uk: *Додамо ще\?*

source: *Принято\!* Добавим кнопку со ссылкой?
uk: *Прийнято\!* Додамо кнопку з посиланням?

source: *Отправьте ссылку которую хотите поместить в кнопку\.*
uk: *Надішліть посилання яке бажаєте помістити в кнопку\.*

source: *Некоректный формат ссылки\, попробуйте еще раз*
uk: *Некоректний формат посилання\, спробуйте ще раз*

source: Присоединиться!
uk: Приєднатися!

source: ➡️ Перейти к боту ⬅️
uk: ➡️ Перейти до боту ⬅️

source: Список всех локаций 📋
uk: Перелік усіх локацій 📋

source: Добавить локацию 🆕
uk: Додати локацію 🆕

source: Добавить ✅
uk: Додати ✅

source: Продолжить без кнопки ❎
uk: Продовжити без кнопки ❎

source: Подтвердить ✅
uk: Підтвердити ✅

source: Отменить ❌
uk: Відмінити ❌

source: Купить кофе разработчику
uk: Купити каву розробнику

source: Начать игру в новом чате ➕
uk: Почати гру в новому чаті ➕

source: Язык
uk: Мова

source: Купить кофе ☕️
uk: Купити каву ☕️

source: Фидбэк 💬
uk: Фідбек 💬

source: Меню для админов ➡️
uk: Меню для адмінів ➡️

source: Фидбэки 💬
uk: Фідбеки 💬

source: Ошибка ❗️
uk: Помилка ❗️

source: Назначить админа 🙎‍♂️
uk: Призначити адміна 🙎‍♂️

source: Создать рассылку 🔊
uk: Створити розсилку 🔊

source: Локации 📌
uk: Локації 📌

source: Обычное меню ⬅️
uk: Звичайне меню ⬅️

source: Обновить 🔄
uk: Оновити 🔄

source: Последние фидбеки
uk: Останні фідбеки

source: Ответить на фидбек
uk: Відповісти на фідбек

source: Выбрать пользователя 👤
uk: Вибрати користувача 👤

source: Слишком много действий за короткое время, подождите немного, и попробуте еще раз.
uk: Забагато дій за короткий час, почекайте трохи, та спробуйте ще раз.

source: Слишком много действий за короткое время\, подождите немного\, и попробуте еще раз\.
uk: Забагато дій за короткий час\, почекайте трохи\, та спробуйте ще раз\.

source: *Набор в игру\!* 🔊
uk: *Набір до гри\!* 🔊

source: Осталось _{seconds}_ секунд\! ⏳
uk: Залишилось _{seconds}_ секунд\! ⏳

source: *Присоединившиеся участники:*
uk: *Учасники, що приєдналися:*

source: _Всего {players_count} участник\(\-ов\)\. 👤_
uk: _Всього {players_count} учасник\(\-ів\)\. 👤_

source: *Начинается обсуждение\! 🗣* _Игра будет длиться: {min} минут\(\-ы\) ⏳_ *Игроки:*
uk: *Починається обговорення\! 🗣* _Гра буде тривати: {min} хвилин\(\-и\) ⏳_ *Гравці:*

source: _Всего {players_count} участников\. 👤_
uk: _Всього {players_count} учасників\. 👤_

source: *Статистика 📈* _Время обновления: {now_time}_ Кол\-во пользователей: {users_count} Пользователи ru: {users_ru_count} Пользователи uk: {users_uk_count} Пользователи en: {users_en_count} Общее кол\-во игр: {games_count} Кол\-во активных игр: {active_games_count}
uk: *Статистика 📈* _Час оновлення: {now_time}_ Кіл\-ть користувачів: {users_count} Користувачі ru: {users_ru_count} Користувачі uk: {users_uk_count} Користувачі en: {users_en_count} Загальна кіл\-ть ігор: {games_count} Кіл\-ть активних ігор: {active_games_count}

source: *Вас приветствует бот для игры в Шпиона\! 👋* *Правила игры следующие:* Чтобы начать играть\, вам нужно написать команду /game непосредственно в группе где планируется игра\. Минимальное кол\-во человек для игры \- 4\, максимальное \- 10\. После завершения набора игроков\, бот вышлет вам вашу роль на эту игру\. В игре есть две роли: *Шпион* \- задача которого не выдать свою роль до конца игры\. *Не Шпион* \- задача которого постараться вычислить шпиона\. Если ваша роль \- "Не Шпион"\, то бот скажет локацию для этой игры\. Задача всех игроков на протяжении игры \- задавать вопросы по локации\, чтобы вычислить шпиона\. После завершения игры проводится голосование\, все участники игры голосуют за возможного шпиона\. Если большинство игроков выбирают неправильного игрока\, то Шпион побеждает\. Если же шпиона вычислили\, и большинство игроков проголосовало за него\, то у него еще есть шанс победить\, назвав локацию игры которое он понял исходя из заданных ранее вопросов\. *Удачной игры\!*
uk: *Вас вітає бот для гри в Шпигуна\! 👋* *Правила гри наступні:* Щоб почати гру\, вам потрібно ввести команду /game безпосередньо в групі де планується гра\. Мінімальна кіл\-ть учасників для гри \- 4\, максимальна \- 10\. Після завершення набору до гри\, бот відішле вам у особисті повідомлення вашу роль на гру\. У грі є дві ролі: *Шпигун* \- задача якого не видати свою роль до кінця гри\. *Не Шпигун* \- задача якого вирахувати шпигуна серед інших гравців\. Якщо ваша роль \- "Не Шпигун"\, то бот надішле вам локацію до цієї гри\. Задача усіх на протязі гри \- задавати питання по локації\, аби вирахувати шпигуна\. Після завершення гри проводиться голосування\, усі учасники гри голосують за можливого шпигуна\. Якщо більшість вибирає не правильного шпигуна\, то Шпигун перемагає\. Якщо шпигуна вдалося вирахувати та більшість гравців проголосували проти нього\, то він ще має шанс перемогти\, назвавши локацію цієї гри яку він зрозумів з заданих раніше питань\. *Гарної гри\!*

source: Вот последние отзывы:
uk: Ось останні фідбеки:

source: *Рассылка начата\!*
uk: *Розсилка почата\!*

source: *Рассылка закончена\!* Всего разослано для _{count}_ пользователей\.
uk: *Розчилка закінчена\!* Всього розіслано для _{count}_ користувачів\.
